Repository: Niq1982/h1-contact-manager
Catalog: languages/h1cm-*.po
Languages: fi

source: Contact information
fi: Yhteystiedot

source: Last name
fi: Sukunimi

source: First Name
fi: Etunimi

source: Phone 1
fi: Puhelin 1

source: Phone 2
fi: Puhelin 2

source: Email address
fi: Sähköpostiosoite

source: Title
fi: Tehtävä

source: Additional info
fi: Lisätiedot

source: Contact photo
fi: Henkilön kuva

source: Set contact photo
fi: Aseta henkilön kuva

source: Remove contact photo
fi: Poista kuva

source: Contacts
fi: Yhteystiedot

source: Contact
fi: Yhteystieto

source: Add new
fi: Lisää uusi

source: Add new Contact
fi: Lisää uusi yhteystieto

source: Edit Contact
fi: Muokkaa henkilön tietoja

source: New Contact
fi: Uusi yhteystieto

source: All Contacts
fi: Kaikki yhteystiedot

source: View Contact
fi: Näytä yhteystieto

source: Search Contacts
fi: Hae yhteystietoja

source: No Contacts found
fi: Yhteystietoja ei löydy

source: No Contacts found in Trash
fi: Yhteystietoja ei löydy roskakorista

# Taxonomy plural name
source: Contact Groups
fi: Yhteystietoryhmät

# Taxonomy singular name
source: Contact Group
fi: Yhteystietoryhmä

source: Search Contact Groups
fi: Etsi yhteystietoryhmiä

source: Popular Contact Groups
fi: Suositut yhteystietoryhmät

source: All Contact Groups
fi: Kaikki ryhmät

source: Parent Contact Group
fi: Yläryhmä

source: Edit Contact Group
fi: Muokkaa ryhmää

source: Update Contact Group
fi: Päivitä ryhmä

source: Add New Contact Group
fi: Lisää uusi ryhmä

source: New Contact Group Name
fi: Uusi ryhmän nimi

source: Add or remove Contact Groups
fi: Lisää tai poista ryhmiä

source: Choose from most used Contact Groups
fi: Valitse eniten käytetyistä ryhmistä

source: Contact Group
fi: Yhteystietoryhmä

source: H1 Contact Manager
fi: H1 Yhteystietohakemisto

source: Add and manage contacts
fi: Lisää tai poista yhteystietoja
